модель оси
	физический - кабели, rj45, rs322
	канальный - ethernet, mac, router, swicher
	сетевой - ip, icmp
	транспортный - tcp, tls, ssl
	сесионный - rpc, rtp
	представления - html, doc
	прикладно - www, http, p2p

switch
	принимает сигнал на порт
	смотрит таблицу mac
	если есть mac в таблице и передаёт на порт
	если нет mac, то передаёт данные на все порты, кроме исходного
	обновить таблицу
	Switch #show mac-address-table

ip
	уровень модели сетевой (3)
	логический адрес, который присваивается устройству для взаимодействия с другими устройствами в сетях
	длина 32/128
	может быть статическим и динамическим

mac
	уровень модели канальный (2)
	физический адрес закрепленный за его сетевым адаптером
	длина 48
	обычно постоянный

Port Security
	функция комутаторов, которая ограничивает масимальное количество подключённых устройств

	ограниченное количество mac адресов - задаётся администратором сети
	Фиксированные MAC-адреса - запоминает конкретный mac адрес и разрешает доступ к порту только этому mac
	Динамическое обучение MAC-адресов - может "выучивать" MAC-адреса, запоминая первый адрес, который подключается к порту, и запрещая доступ остальным адресам

	Switch> enable
	Switch# configure terminal
	Switch(config)# interface fa0/1
	Switch(config-if)# switchport port-security
	Switch(config-if)# switchport port-security maximum 1
	Switch(config-if)# switchport port-security mac-address 00D0.97F1.1111

	Protect (защищать, блокировать только незарегистрированные MAC-адреса, не уведомляя):
	Switch(config-if)# switchport port-security violation protect

	Restrict (ограничение, блокирует незарегистрированные MAC-адреса и записывает события в лог):
	Switch(config-if)# switchport port-security violation restrict

	Shutdown (выключить порт, если нарушено правило):
	Switch(config-if)# switchport port-security violation shutdown

Trunk 
	 для передачи трафика нескольких VLAN (Virtual Local Area Networks) через один физический линк между коммутаторами или между коммутатором и маршрутизатором
	
	Switch> enable
	Switch# configure terminal
	Switch(config)# interface fa0/1
	Switch(config-if)# switchport mode trunk
	Switch# show interface fa0/1 trunk

VLAN 
	 это логическое разделение физической сети на несколько виртуальных сегментов, что позволяет улучшить безопасность и управление сетью. Каждому устройству в VLAN назначается уникальный идентификатор (ID), который помогает изолировать трафик между различными VLAN. Это дает возможность разделять сети на группы, даже если устройства находятся на одном физическом оборудовании
